In [58]:
import ds_utils
import pandas as pd
df = pd.read_csv('train.csv')

y = df['Survived']
df = df.drop(columns=['Survived'])

train_num = len(df)
df = pd.concat((df, pd.read_csv('test.csv')))

In [59]:
# PLots 2 distributions of a feature: survived or not survived
# This helps us to see where the difference in distributions
def plot_feature_distribution(df, feature, is_hist=False):
    bins = np.linspace(df[feature].min(), df[feature].max(), 30)
    if is_hist:
        sns.distplot([df[df['Survived'] == 0][feature], df[df['Survived'] == 1][feature]], hist = True, 
            norm_hist = True, kde = False, 
            bins = bins, color = ['blue', 'red'], label=['Didnt Survive', 'Survived'],
            hist_kws = {'edgecolor':'black'})
    else:
        sns.kdeplot(df[df['Survived'] == 0][feature], shade=True, color='Blue', label='Didnt Survive')
        sns.kdeplot(df[df['Survived'] == 1][feature], shade=True, color='Red', label='Survived')
    plt.legend(prop={'size': 13}, title = 'Have Survived')
    plt.title('Density Plot of ' + feature, fontsize=15)
    plt.xlabel(feature, fontsize=20)
    plt.ylabel('Density', fontsize=20)
    fig=plt.gcf()
    fig.set_size_inches(8, 8)
    plt.show()

In [60]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [61]:
df['Name'].head(10)

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                     Moran, Mr. James
6                              McCarthy, Mr. Timothy J
7                       Palsson, Master. Gosta Leonard
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                  Nasser, Mrs. Nicholas (Adele Achem)
Name: Name, dtype: object

In [62]:
df['LastName'] = df['Name'].apply(lambda x: x.split(',')[0])

In [63]:
df['LastName'].head()

0       Braund
1      Cumings
2    Heikkinen
3     Futrelle
4        Allen
Name: LastName, dtype: object

In [64]:
df['Title'] = df['Name'].apply(lambda x: x.split(',')[1].split('.')[0])

In [65]:
df['Title'].head()

0       Mr
1      Mrs
2     Miss
3      Mrs
4       Mr
Name: Title, dtype: object

In [66]:
df['FirstName'] = df['Name'].apply(lambda x: x.split(',')[1].split('.')[1].split(' ')[1])

In [67]:
df['FirstName'].head()

0       Owen
1       John
2      Laina
3    Jacques
4    William
Name: FirstName, dtype: object

In [68]:
df = df.drop(columns=['Ticket', 'PassengerId', 'Name'])

In [69]:
ds_utils.get_nan_col_proportions(df)

[('Age', 0.20091673032849502),
 ('Fare', 0.0007639419404125286),
 ('Cabin', 0.774637127578304),
 ('Embarked', 0.0015278838808250573)]

In [70]:
df['Cabin'].head(10)

0     NaN
1     C85
2     NaN
3    C123
4     NaN
5     NaN
6     E46
7     NaN
8     NaN
9     NaN
Name: Cabin, dtype: object

In [71]:
# import numpy as np
# df['Cabin'] = df['Cabin'].fillna(' ') 
# df['CabinLetter'] = df.apply(lambda row: ' ' if row['Cabin'] == ' ' else row['Cabin'][0], axis=1)

In [72]:
# df['CabinLetter'].head()

In [73]:
df = df.drop(columns=['Cabin'])

In [74]:
import numpy as np

# nanAge = df.apply(lambda row: True if row['Age'] == np.nan else False, axis=1)
# age = replace_missing_with_ml(df, 'Age')['Age']

# nanFare = df.apply(lambda row: True if row['Fare'] == np.nan else False, axis=1)
# fare = replace_missing_with_ml(df, 'Fare')['Fare']

age = df['Age'].fillna(df['Age'].median())

fare = df['Fare'].fillna(df['Fare'].median())

embarked = df['Embarked'].fillna(df['Embarked'].mode()[0])

# nanEmbarked = df.apply(lambda row: True if row['Embarked'] == np.nan else False, axis=1)
# embarked = replace_missing_with_ml(df, 'Embarked', is_classify=True)['Embarked']

# df = df.drop(columns=['CabinLetter'])

# df['CabinLetter'] = df['CabinLetter'].replace(to_replace=' ', value=np.nan)

# nanCabinLetter = df.apply(lambda row: True if row['CabinLetter'] == np.nan else False, axis=1)
# cabinLetter = replace_missing_with_ml(df, 'CabinLetter', is_classify=True)['CabinLetter']

In [75]:
#df['nanAge'] = nanAge
df['Age'] = age

#df['nanFare'] = nanFare 
df['Fare'] = fare

# df['nanEmbarked'] = nanEmbarked 
df['Embarked'] = embarked

# df['nanCabinLetter'] = nanCabinLetter
# df['CabinLetter'] =cabinLetter

In [76]:
df.head()

,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,LastName,Title,FirstName
0,3,male,22.0,1,0,7.2500,S,Braund,Mr,Owen
1,1,female,38.0,1,0,71.2833,C,Cumings,Mrs,John
2,3,female,26.0,0,0,7.9250,S,Heikkinen,Miss,Laina
3,1,female,35.0,1,0,53.1000,S,Futrelle,Mrs,Jacques
4,3,male,35.0,0,0,8.0500,S,Allen,Mr,William

In [77]:
df['Embarked'] = df['Embarked'].astype('category')
df['LastName'] = df['LastName'].astype('category')
df['FirstName'] = df['FirstName'].astype('category')
df['Title'] = df['Title'].astype('category')
#df['CabinLetter'] = df['CabinLetter'].astype('category')
df['Sex'] = df['Sex'].astype('category')
# df['isAlone'] =

In [78]:
df2 = df.copy()

In [79]:
df = pd.get_dummies(df)

In [80]:
df.head()

,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S,...,FirstName_Wilhelm,FirstName_William,FirstName_Winifred,FirstName_Woolf,FirstName_Wyckoff,FirstName_Ylio,FirstName_Yoto,FirstName_Youssef,FirstName_Yousseff,FirstName_of
0,3,22.0,1,0,7.2500,0,1,0,0,1,...,0,0,0,0,0,0,0,0,0,0
1,1,38.0,1,0,71.2833,1,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
2,3,26.0,0,0,7.9250,1,0,0,0,1,...,0,0,0,0,0,0,0,0,0,0
3,1,35.0,1,0,53.1000,1,0,0,0,1,...,0,0,0,0,0,0,0,0,0,0
4,3,35.0,0,0,8.0500,0,1,0,0,1,...,0,1,0,0,0,0,0,0,0,0

In [81]:
df_train = df[:train_num].copy()
df_train['Survived'] = y
df_test = df[train_num:].copy()

In [82]:
df_train.to_csv('clean_train.csv', index=False)
df_test.to_csv('clean_test.csv', index=False)